Config/Catalogs/ШаблоныЗаполненияПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныЗаполненияПП</Name>
			<Comment>Шаблоны текста поля платежного поручения "Назначение платежа"</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделительЭлементовПовторяющейсяЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданныхИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Образ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДопРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДопСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяУчетныйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Последовательность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючУсловнойЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПовторяющаясяЧасть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПутьКДанным</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПример</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВПоследовательности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДерева</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ШаблоныЗаполненияПП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗадатьСтрокуФорматаНДСПоУмолчанию() Экспорт
	Возврат "ИСТИНА
			|Ставка
			|ИСТИНА
			|Сумма
			|ЧДЦ=2
			|ИСТИНА
			|Без НДС
			|руб.";
КонецФункции // ЗадатьСтрокуФорматаНДСПоУмолчанию
		
Функция ПредставлениеФорматаНДС(ФорматНДС, СуммаНДС = Неопределено, СтавкаНДС = Неопределено) Экспорт
	Если ФорматНДС <> "" Тогда
		НДС_ВыводитьСтавкуНДС = Булево(СтрПолучитьСтроку(ФорматНДС, 1));
		НДС_ТекстСтавкаНДС = СтрПолучитьСтроку(ФорматНДС, 2);
		НДС_ВыводитьСуммуНДС = Булево(СтрПолучитьСтроку(ФорматНДС, 3));
		НДС_ТекстСуммаНДС = СтрПолучитьСтроку(ФорматНДС, 4);
		НДС_ФорматСуммыНДС = СтрПолучитьСтроку(ФорматНДС, 5);
		НДС_ВыводитьТекстБезНДС = Булево(СтрПолучитьСтроку(ФорматНДС, 6));
		НДС_ТекстБезНДС = СтрПолучитьСтроку(ФорматНДС, 7);
		
		Если СтрЧислоСтрок(ФорматНДС) = 8 Тогда
			НДС_Валюта = СтрПолучитьСтроку(ФорматНДС, 8);
		Иначе
			НДС_Валюта = "руб.";
		КонецЕсли;
		
		Возврат ?(НДС_ВыводитьСтавкуНДС, НДС_ТекстСтавкаНДС + " " + ?(ЗначениеЗаполнено(СтавкаНДС), СтавкаНДС, ""), "") + 
				?(НДС_ВыводитьСуммуНДС, НДС_ТекстСуммаНДС + " " + 
						Формат(?(СуммаНДС<>Неопределено, СуммаНДС, 999.99), НДС_ФорматСуммыНДС) + " " + НДС_Валюта, "") +
				?(НДС_ВыводитьТекстБезНДС, " / " + НДС_ТекстБезНДС, "");
	Иначе
		Возврат "";			
	КонецЕсли;
КонецФункции // ПредставлениеФорматаНДС
		
Функция ФорматКБКВСтроку(ТекущийФорматКБК, РазделительРазрядовКБК = " ") Экспорт
	
	Результат = "";
	
	СтрокиУдалить = Новый Массив;
	
	Для Каждого ВидКБК Из ТекущийФорматКБК Цикл
		Если ВидКБК.Настройка.Количество() = 0 Тогда
			СтрокиУдалить.Добавить(ВидКБК);
		КонецЕсли;
	КонецЦикла;		   
	
	Для Каждого Стр Из СтрокиУдалить Цикл
		ТекущийФорматКБК.Удалить(Стр);
	КонецЦикла;		  
	
	К = 0;
	Для Каждого ВидКБК Из ТекущийФорматКБК Цикл
		
		Для Каждого Группа Из ВидКБК.Настройка Цикл
			Результат = Результат + ?(Группа.Значение > 0, Группа.Значение, "0") + ";";
		КонецЦикла;
		
		К = К + 1;
		
		Если К < ТекущийФорматКБК.Количество() Тогда
			Результат = Результат + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Результат + Символы.ПС + РазделительРазрядовКБК;
				
	Возврат Результат;	
	
КонецФункции // ФорматКБКВСтроку

Функция ФорматКБКИзСтроки(ФорматКБК, РазделительРазрядовКБК = "") Экспорт
	ТекущийФорматКБК = Новый ТаблицаЗначений;
	ТекущийФорматКБК.Колонки.Добавить("Настройка", Новый ОписаниеТипов("СписокЗначений"));
	
	Если СокрЛП(ФорматКБК) = "" Тогда
		Возврат ТекущийФорматКБК;
	КонецЕсли;
	
	КоличествоСтрок = СтрЧислоСтрок(ФорматКБК);
	
	Если КоличествоСтрок = 7 Тогда
		РазделительРазрядовКБК = СтрПолучитьСтроку(ФорматКБК, КоличествоСтрок);
		КоличествоСтрок = 6;
	Иначе
		РазделительРазрядовКБК = " ";
	КонецЕсли;
	
	Для К = 1 По КоличествоСтрок Цикл
		ВидКБК = ТекущийФорматКБК.Добавить();
		
		Стр = СтрПолучитьСтроку(ФорматКБК, К);
		
		КоличествоРазделителей = СтрЧислоВхождений(Стр, ";");
		
		Для Н = 1 По КоличествоРазделителей Цикл
			ВидКБК.Настройка.Добавить(Число(Лев(Стр, Найти(Стр, ";") - 1)));
			
			Стр = Сред(Стр, Найти(Стр, ";") + 1);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТекущийФорматКБК;
КонецФункции // ФорматКБКИзСтроки

Функция ЗадатьФорматКБКПоУмолчанию() Экспорт
	ТекущийФорматКБК = Новый ТаблицаЗначений;
	ТекущийФорматКБК.Колонки.Добавить("Настройка", Новый ОписаниеТипов("СписокЗначений"));	
	
	Для К = 1 По 6 Цикл
		ТекущийФорматКБК.Добавить().Настройка = Новый СписокЗначений;
	КонецЦикла;
	
	ТекущийФорматКБК[0].Настройка.Добавить(3);
	ТекущийФорматКБК[0].Настройка.Добавить(7);
	ТекущийФорматКБК[0].Настройка.Добавить(4);
	ТекущийФорматКБК[0].Настройка.Добавить(3);
	
	ТекущийФорматКБК[1].Настройка.Добавить(4);
	ТекущийФорматКБК[1].Настройка.Добавить(10);
	ТекущийФорматКБК[1].Настройка.Добавить(10);
	ТекущийФорматКБК[1].Настройка.Добавить(3);
	
	ТекущийФорматКБК[2].Настройка.Добавить(4);
	ТекущийФорматКБК[2].Настройка.Добавить(6);
	ТекущийФорматКБК[2].Настройка.Добавить(4);
	ТекущийФорматКБК[2].Настройка.Добавить(3);

	ТекущийФорматКБК[3].Настройка.Добавить(17);
	
	ТекущийФорматКБК[4].Настройка.Добавить(17);
	
	ТекущийФорматКБК[5].Настройка.Добавить(4);
	ТекущийФорматКБК[5].Настройка.Добавить(10);
	ТекущийФорматКБК[5].Настройка.Добавить(3);
	
	Возврат ТекущийФорматКБК;
	
КонецФункции // ЗадатьФорматКБКПоУмолчанию

Функция СоответствуетКритериямОтбора(Шаблон, ДокОбъект)
	НастройкиОтбора = Шаблон.Отбор.Получить();
	
	Если НастройкиОтбора = Неопределено Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	СКД = Новый СхемаКомпоновкиДанных;
	
	Источник = СКД.ИсточникиДанных.Добавить();
	Источник.Имя = "ИсточникДанных1";
	Источник.ТипИсточникаДанных = "local";
	
	Набор = СКД.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	Набор.ИсточникДанных = "ИсточникДанных1";
	Набор.Имя = "ОсновнойНаборДанных";
	Набор.ИмяОбъекта = Набор.Имя;
	
	МД = ДокОбъект.Метаданные();
	ТЗ = Новый ТаблицаЗначений;
	ВНД = Новый Структура;
	
	Для Каждого Реквизит Из МД.Реквизиты Цикл
		Если Реквизит.Имя = "Номер" ИЛИ
				Реквизит.Имя = "Дата" ИЛИ
				Найти(Реквизит.Имя, "Сумма") > 0 ИЛИ
				Реквизит.Имя = "НазначениеПлатежа" Тогда
			Продолжить;
		КонецЕсли;
	
		НовоеПоле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.ВыражениеПредставления = Реквизит.Синоним;
		НовоеПоле.Поле = Реквизит.Имя;
		НовоеПоле.ПутьКДанным = Реквизит.Имя;
		НовоеПоле.ТипЗначения = Реквизит.Тип;
		
		ТЗ.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), ДокОбъект);
	ТЗ.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЗаполненияПП"));
	ТЗ[0].Ссылка = Шаблон.Ссылка;
	ВНД.Вставить("ОсновнойНаборДанных", ТЗ);
	
	НовоеПоле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовоеПоле.ВыражениеПредставления = "Ссылка";
	НовоеПоле.Поле = "Ссылка";
	НовоеПоле.ПутьКДанным = "Ссылка";
	НовоеПоле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ШаблоныЗаполненияПП");
	НовоеПоле.ОграничениеИспользования.Условие = ИСТИНА;
	НовоеПоле.ОграничениеИспользованияРеквизитов.Условие = ИСТИНА;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СКД, НастройкиОтбора, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет, ВНД);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат.Количество() > 0;
КонецФункции // СоответствуетКритериямОтбора

Функция ПолучитьСписокШаблонов(ДокОбъект) Экспорт
	Выборка = Справочники.ШаблоныЗаполненияПП.Выбрать(,, Новый Структура("ОбъектМетаданныхИмя", ДокОбъект.Метаданные().Имя));
	
	СписокШаблонов = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если СоответствуетКритериямОтбора(Выборка, ДокОбъект) Тогда
			СписокШаблонов.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокШаблонов;
КонецФункции // ПолучитьСписокШаблонов

#КонецОбласти

#КонецЕсли
